app/Http/Controllers/Github/GithubApiController.php

select * from `githubs` limit 1
---
    public function __construct()
    {
        $this->github = Github::firstOrFail();