app/Http/Controllers/Auth/LoginController.php

    public function showLoginForm()
    {
        try {

            $bussinesses = Bussiness::pluck('name', 'short')->toArray();
            $status = StatusSetting::select('recaptcha_status', 'msg91_status', 'emailverification_status', 'terms')->first();
            $apiKeys = ApiKey::select('nocaptcha_sitekey', 'captcha_secretCheck', 'msg91_auth_key', 'terms_url')->first();
            $analyticsTag = ChatScript::where('google_analytics', 1)->where('on_registration', 1)->value('google_analytics_tag');
---
select `name`, `short` from `bussinesses`
select `recaptcha_status`, `msg91_status`, `emailverification_status`, `terms` from `status_settings` limit 1
select `nocaptcha_sitekey`, `captcha_secretCheck`, `msg91_auth_key`, `terms_url` from `api_keys` limit 1
select `google_analytics_tag` from `chat_scripts` where `google_analytics` = 1 and `on_registration` = 1 limit 1

    public function login(Request $request)
    {
    $status = StatusSetting::value('v3recaptcha_status');
---
select `recaptcha_status` from `status_settings` limit 1