app/Http/helpers.php

function findCountryByGeoip($iso)
{
    try {
        $country = \App\Model\Common\Country::where('country_code_char2', $iso)->first();
---
select * from `countries` where `country_code_char2` = 'US' limit 1

function getIndianCurrencySymbol($currency)
{
    return \DB::table('format_currencies')->where('code', $currency)->value('symbol');
---
select `symbol` from `format_currencies` where `code` = 'INR' limit 1