app/Http/Middleware/Admin.php

    public function handle($request, Closure $next)
    {
        $defaulturl = DefaultPage::pluck('page_url')->first();
---
select `page_url` from `default_pages`