app/Http/Controllers/Common/SocialMediaController.php

select * from `api_keys` where `api_keys`.`id` = 1 limit 1
---
    public function getTweets()
    {
        try {
            $tweet_limit = 2;
            $username = 'faveohelpdesk';
            $consumer_key = ApiKey::find(1)->value('twitter_consumer_key');