app/Model/Order/Invoice.php

    public function getCreatedAtAttribute($value)
    {
        $date1 = new DateTime($value);
        $tz = \Auth::user()->timezone()->first()->name;
---
select * from `timezone` where `timezone`.`id` = 79 limit 1