app/Model/Order/Order.php

    public static function getOrderLink($orderId, $url = 'orders')
    {
        $link = '--';
        $order = Order::where('id', $orderId)->select('id', 'number')->first();
---
select `id`, `number` from `orders` where `id` = 1 limit 1