app/Http/Controllers/License/LicenseController.php

    public function __construct()
    {
        $model = new ApiKey();
        $this->license = $model->first();
---
select * from `api_keys` limit 1