app/Http/Controllers/DashboardController.php

    public function getSoldProducts(?int $noOfDays = null): mixed
    {
        // ASSUMING THIS CODE WON"T STAY ALIVE TILL year 3000
        $dateBefore = $noOfDays ? new Carbon(sprintf('-%s days', $noOfDays))->toDateTimeString() : Date::now()->startOfMillennium()->toDateTimeString();

        return Order::join('products', 'products.id', '=', 'orders.product')
            ->select(DB::raw('COUNT(*) as order_count'), 'products.id as product_id',
                'orders.created_at as order_created_at', 'products.image as product_image', 'products.name as product_name')
            ->where('order_status', 'executed')
            ->where('orders.created_at', '>', $dateBefore)
            ->orderBy('order_count', 'desc')
            ->orderBy('orders.created_at', 'desc')
            ->groupBy('products.id')
            ->get()->map(function ($element) {
                // product_image already set on element
                $element->order_created_at = getTimeInLoggedInUserTimeZone($element->order_created_at); // @phpstan-ignore property.notFound, property.notFound

                return $element;
            });
---
select count(*) as aggregate from `orders` where `created_at` between '2023-03-25 04:51:32' and '2023-04-24 04:51:32'