app/Http/Controllers/DashboardController.php

select * from `settings` where `settings`.`id` = 1 limit 1
select `code` from `currencies` where `dashboard_currency` = 1
select `symbol` from `currencies` where `dashboard_currency` = 1
---
    public function index(Request $request)
    {
        $allowedCurrencies1 = Setting::find(1)->value('default_currency');
        $currency1Symbol = Setting::find(1)->value('default_symbol');
        $allowedCurrencies2 = Currency::where('dashboard_currency', 1)->pluck('code')->first();
        $currency2Symbol = Currency::where('dashboard_currency', 1)->pluck('symbol')->first();

select `grand_total` from `invoices` where `currency` = 'INR' and `status` = 'pending'
---
    public function getPendingPaymentsCur2($allowedCurrencies2)
    {
        $total = Invoice::where('currency', $allowedCurrencies2)
        ->where('status', '=', 'pending')
        ->pluck('grand_total')->all();

select COUNT(*) as order_count, `products`.`id` as `product_id`, `orders`.`created_at` as `order_created_at`, `products`.`image` as `product_image`, `products`.`name` as `product_name` from `orders` inner join `products` on `products`.`id` = `orders`.`product` where `order_status` = 'executed' and `orders`.`created_at` > '2023-03-25 04:51:32' group by `products`.`id` order by `order_count` desc, `orders`.`created_at` desc
---
    public function getSoldProducts(int $noOfDays = null)
    {
        // ASSUMING THIS CODE WON"T STAY ALIVE TILL year 3000
        $dateBefore = $noOfDays ? (new Carbon("-$noOfDays days"))->toDateTimeString() : Carbon::now()->startOfMillennium()->toDateTimeString();

        return Order::join('products', 'products.id', '=', 'orders.product')
            ->select(\DB::raw('COUNT(*) as order_count'), 'products.id as product_id',
                'orders.created_at as order_created_at', 'products.image as product_image', 'products.name as product_name')
            ->where('order_status', 'executed')
            ->where('orders.created_at', '>', $dateBefore)
            ->orderBy('order_count', 'desc')
            ->orderBy('orders.created_at', 'desc')
            ->groupBy('products.id')
            ->get()->map(function ($element) {
                $element->product_image = (new Product())->getImageAttribute($element->product_image);
                $element->order_created_at = getTimeInLoggedInUserTimeZone($element->order_created_at);

                return $element;
            });

select `id`, `first_name`, `last_name`, `email`, `user_name` from `users` where `users`.`id` in (13850) and `users`.`deleted_at` is null
select `products`.`id` as `product_id`, `orders`.`created_at` as `order_created_at`, `number` as `order_number`, `client`, `orders`.`id` as `order_id`, `products`.`name` as `product_name` from `orders` inner join `products` on `products`.`id` = `orders`.`product` where `orders`.`created_at` > '2023-03-25 04:51:32' and `price_override` > 0 order by `orders`.`id` desc
---
    public function getRecentOrders()
    {
        $dateBefore = (new Carbon('-30 days'))->toDateTimeString();

        return Order::with('user:id,first_name,last_name,email,user_name')
            ->join('products', 'products.id', '=', 'orders.product')
            ->select('products.id as product_id', 'orders.created_at as order_created_at', 'number as order_number', 'client', 'orders.id as order_id', 'products.name as product_name')
            ->where('orders.created_at', '>', $dateBefore)
            ->where('price_override', '>', 0)
            ->orderBy('orders.id', 'desc')
            ->get()->map(function ($element) {
                $element->order_created_at = getDateHtml($element->order_created_at);
                $element->client_name = $element->user->first_name.' '.$element->user->last_name;
                $element->client_profile_link = \Config('app.url').'/clients/'.$element->user->id;
                unset($element->user);

                return $element;
            });

select `id`, `first_name`, `last_name`, `email`, `user_name` from `users` where `users`.`id` in (13850) and `users`.`deleted_at` is null
select `invoices`.`id` as `invoice_id`, `invoices`.`number` as `invoice_number`, `invoices`.`grand_total`, `invoices`.`status`, SUM(payments.amount) as paid, `invoices`.`user_id`, `currencies`.`code` as `currency_code` from `invoices` left join `currencies` on `invoices`.`currency` = `currencies`.`code` left join `payments` on `invoices`.`id` = `payments`.`invoice_id` where `invoices`.`created_at` > '2023-03-25 04:51:32' and `invoices`.`grand_total` > 0 group by `invoices`.`id` order by `invoices`.`created_at` desc
---
    public function getRecentInvoices()
    {
        $dateBefore = (new Carbon('-30 days'))->toDateTimeString();

        return Invoice::with('user:id,first_name,last_name,email,user_name')
            ->leftJoin('currencies', 'invoices.currency', '=', 'currencies.code')
            ->leftJoin('payments', 'invoices.id', '=', 'payments.invoice_id')
            ->select('invoices.id as invoice_id', 'invoices.number as invoice_number', 'invoices.grand_total', 'invoices.status',
                \DB::raw('SUM(payments.amount) as paid'), 'invoices.user_id', 'currencies.code as currency_code')
            ->where('invoices.created_at', '>', $dateBefore)
            ->where('invoices.grand_total', '>', 0)
            ->groupBy('invoices.id')
            ->orderBy('invoices.created_at', 'desc')
            ->get()->map(function ($element) {
                $element->balance = (int) ($element->grand_total - $element->paid);
                $element->status = getStatusLabel($element->status);
                $element->grand_total = currency_format((int) $element->grand_total, $element->currency_code);
                $element->paid = currency_format((int) $element->paid, $element->currency_code);
                $element->balance = currency_format((int) $element->balance, $element->currency_code);
                $element->client_name = $element->user->first_name.' '.$element->user->last_name;
                $element->client_profile_link = \Config('app.url').'/clients/'.$element->user->id;
                unset($element->user);

                return $element;
            });

select `version` from `subscriptions` order by `version` desc limit 1
select `orders`.`id`, concat(first_name, ' ', last_name) as client_name, `products`.`name` as `product_name`, `products`.`id` as `product_id`, `subscriptions`.`version` as `product_version`, `client` as `client_id`, `subscriptions`.`update_ends_at` as `subscription_ends_at` from `orders` left join `subscriptions` on `orders`.`id` = `subscriptions`.`order_id` left join `users` on `orders`.`client` = `users`.`id` left join `products` on `orders`.`product` = `products`.`id` where `price_override` > 0 and `subscriptions`.`updated_at` > '2023-03-25 04:51:32' and `subscriptions`.`update_ends_at` < '2023-05-24 04:51:32' and `subscriptions`.`version` < 'v6.0.2' and `subscriptions`.`version` is not null and `subscriptions`.`version` != '' order by `subscription_ends_at` desc limit 30
---
    private function getClientsUsingOldVersions()
    {
        $date = new Carbon('-30 days');
        $latestVersion = (string) Subscription::orderBy('version', 'desc')->value('version');

        // query the latest version and query for rest of the versions
        return Order::leftJoin('subscriptions', 'orders.id', '=', 'subscriptions.order_id')
            ->leftJoin('users', 'orders.client', '=', 'users.id')
            ->leftJoin('products', 'orders.product', '=', 'products.id')
            ->where('price_override', '>', 0)
            ->where('subscriptions.updated_at', '>', $date)
            ->where('subscriptions.version', '<', $latestVersion)
            ->where('subscriptions.version', '!=', null)
            ->where('subscriptions.version', '!=', '')
            ->select('orders.id', \DB::raw("concat(first_name, ' ', last_name) as client_name"), 'products.name as product_name',
                'subscriptions.version as product_version', 'client as client_id', 'subscriptions.update_ends_at as subscription_ends_at')
            ->orderBy('subscriptions.version', 'asc')
            ->take(30)->get()->map(function ($element) {
                $element->subscription_ends_at = getDateHtml($element->subscription_ends_at);
                $appUrl = \Config::get('app.url');
                $clientProfileUrl = $appUrl.'/clients/'.$element->client_id;
                $element->client_name = "<a href=$clientProfileUrl>$element->client_name</a>";

                return $element;
            });