app/Http/Controllers/WelcomeController.php

    public function getCode()
    {
        $code = '';
        $country = new Country();
        $country_iso2 = $this->request->get('country_id');
        $model = $country->where('country_code_char2', $country_iso2)->select('phonecode')->first();
---
select `phonecode` from `countries` where `country_code_char2` = 'US' limit 1